public/blog/webmaster_project/Bits Of Tips %231.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-07 Thu 17:13 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bits Of Tips #1</title>
<meta name="author" content="thewebmasterp" />
<meta name="description" content="
Bits of Tips is a series of posts containing bits of practical JavaScript tips and tricks." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../../css/style.min.css" />
<link rel="apple-touch-icon" sizes="180x180" href="../../img/meta/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="../../img/meta/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="../../img/meta/favicon-16x16.png">
<link rel="manifest" href="../../site.webmanifest">
</head>
<body>
<div id="preamble" class="status">
<script>0</script>
<nav id='topnav'>
<a class='homeLink' href='/index.html' title='The index, landing page of this website'>Home</a>
<a class='blogLink' href='/blog.html' title='My articles'>Blog</a>
<a class='aboutLink' href='/about.html' title='About the website and its owner'>About</a>
<div class='sparse'>
<div class='theme-changer'></div>
</div> 
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Bits Of Tips #1</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5fc9a91">Numeric Separators</a></li>
<li><a href="#org1969fea">Defined vs Declared</a></li>
<li><a href="#org122f8c1">Debunking complex Destructuring Assignments</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org5fc9a91" class="outline-2">
<h2 id="org5fc9a91">Numeric Separators</h2>
<div class="outline-text-2" id="text-org5fc9a91">
<p>
It is a simple stylistic improvement that will make your code a bit more comprehensible by human beings.
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span>    <span class="org-comment-delimiter">// </span><span class="org-comment">Use _ to separate numerals</span>
<span class="linenr"> 3: </span>    <span class="org-comment-delimiter">// </span><span class="org-comment">for better readability</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>    <span class="org-comment-delimiter">// </span><span class="org-comment">Separators in decimal numbers</span>
<span class="linenr"> 6: </span>    <span class="org-keyword">let</span> <span class="org-variable-name">dec_num</span> = 1_000_000_000 <span class="org-comment-delimiter">// </span><span class="org-comment">=== 1000000000 </span>
<span class="linenr"> 7: </span>    <span class="org-keyword">let</span> <span class="org-variable-name">dec_int_num</span> = 100_000.05 <span class="org-comment-delimiter">// </span><span class="org-comment">=== 100000.05</span>
<span class="linenr"> 8: </span>    <span class="org-keyword">let</span> <span class="org-variable-name">dec_fra_num</span> = 10.000_055 <span class="org-comment-delimiter">// </span><span class="org-comment">=== 10.000_055</span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    <span class="org-comment-delimiter">// </span><span class="org-comment">Separators in binary numbers</span>
<span class="linenr">11: </span>    <span class="org-keyword">let</span> <span class="org-variable-name">bin_num</span> = 0b1010_0001_1000_0101
<span class="linenr">12: </span>
<span class="linenr">13: </span>    <span class="org-comment-delimiter">// </span><span class="org-comment">Separators in octal numbers</span>
<span class="linenr">14: </span>    <span class="org-keyword">let</span> <span class="org-variable-name">oct_num</span> = 0o2_2_5_6
<span class="linenr">15: </span>
<span class="linenr">16: </span>    <span class="org-comment-delimiter">// </span><span class="org-comment">Separators in hex numbers</span>
<span class="linenr">17: </span>    <span class="org-keyword">let</span> <span class="org-variable-name">hex_num</span> = 0xA0_B0_C0
<span class="linenr">18: </span>
<span class="linenr">19: </span>    <span class="org-comment-delimiter">// </span><span class="org-comment">Separators in BigInts</span>
<span class="linenr">20: </span>    <span class="org-keyword">let</span> <span class="org-variable-name">bint_num</span> = 1_000_000_000_000_000_000_000n
<span class="linenr">21: </span>    
</pre>
</div>
</div>
</div>
<div id="outline-container-org1969fea" class="outline-2">
<h2 id="org1969fea">Defined vs Declared</h2>
<div class="outline-text-2" id="text-org1969fea">
<p>
The declaration is the creation of a reference in a scope. Unless the reference is assigned a value it is undefined by default. Definition, on the other hand, could refer to assigned value or documentation of an expected data type 
(for languages that support it).
</p>

<p>
This example should clear the fog:
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>
<span class="linenr">2: </span>  b; <span class="org-comment-delimiter">//</span><span class="org-comment">undeclared and undefined</span>
<span class="linenr">3: </span>  b = 1; <span class="org-comment-delimiter">//</span><span class="org-comment">undeclared and defined</span>
<span class="linenr">4: </span>  <span class="org-keyword">let</span> <span class="org-variable-name">a</span>; <span class="org-comment-delimiter">//</span><span class="org-comment">declared and undefined</span>
<span class="linenr">5: </span>  <span class="org-keyword">let</span> <span class="org-variable-name">a</span> = 1; <span class="org-comment-delimiter">//</span><span class="org-comment">declared and defined</span>
<span class="linenr">6: </span>  
</pre>
</div>
</div>
</div>
<div id="outline-container-org122f8c1" class="outline-2">
<h2 id="org122f8c1">Debunking complex Destructuring Assignments</h2>
<div class="outline-text-2" id="text-org122f8c1">
<p>
This bit assumes that you already understand destructuring and explains to you how to "de-bug" or "de-bunk" or understand complex destructuring.
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">You simply do your destructuring</span>
<span class="linenr"> 3: </span>  <span class="org-keyword">const</span> <span class="org-variable-name">letters</span> = [{a: 1, b: 2}, {a: 3, b: 4}]
<span class="linenr"> 4: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Tra, la, laa....</span>
<span class="linenr"> 5: </span>  <span class="org-keyword">let</span> [{a: <span class="org-variable-name">a1</span>, b: <span class="org-variable-name">b1</span>}, {a: <span class="org-variable-name">a2</span>, b: <span class="org-variable-name">b2</span>}] = letters
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Then to check if you've been correct,</span>
<span class="linenr"> 9: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">compare the logged value of this:</span>
<span class="linenr">10: </span>  console.log( [{a: a1, b: b1}, {a: a2, b: b2}] )
<span class="linenr">11: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">with the actual object "letters"</span>
<span class="linenr">12: </span>  console.log(letters)
<span class="linenr">13: </span>
<span class="linenr">14: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">If they hold the same contents,</span>
<span class="linenr">15: </span>  <span class="org-comment-delimiter">// </span><span class="org-comment">your destructuring is good.</span>
<span class="linenr">16: </span>  
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='remark42'></div>
   <script>
   	 var remark_config = {
	 	host: 'https://remark42.thewebmasterp.com',
	 	site_id: 'remark42.thewebmasterp.com',
	 }
   </script>
   <script>!function(e,n){for(var o=0;o<e.length;o++){var r=n.createElement('script'),c='.js',d=n.head||n.body;'noModule'in r?(r.type='module',c='.mjs'):r.async=!0,r.defer=!0,r.src=remark_config.host+'/web/'+e[o]+c,d.appendChild(r)}}(remark_config.components||['embed'],document);</script>
   <xml>
     <socmedia>
       <entry>
         <label>Github</label>
         <href>https://github.com/thewebmasterp</href>
         <icon>github.svg</icon>
       </entry>
       <entry>
         <label>Instagram</label>
         <href>https://www.instagram.com/webmaster_project</href>
         <icon>instagram.svg</icon>
       </entry>
       <entry>
         <label>Twitter</label>
         <href>https://twitter.com/thewebmasterp</href>
         <icon>twitter.svg</icon>
       </entry>
       <entry>
         <label>Codepen</label>
         <href>https://codepen.io/thewebmasterp</href>
         <icon>codepen.svg</icon>
       </entry>
       <entry>
         <label>Blog RSS Feed</label>
         <href>/blog.xml</href>
         <icon>rss.svg</icon>
       </entry>
     </socmedia>
     <subscribe>
       <cta></cta>
     </subscribe>
     <info>
     </info>
   </xml>
</div>
</body>
</html>
